//******************************************************************************
//
//
//      シーン管理
//
//
//******************************************************************************

//------< インクルード >----------------------------------------------------------
#include "scene.h"
#include "sprite_data.h"

//==============================================================================
//
//      Sceneクラス
//
//==============================================================================

//--------------------------------------------------------------
//  実行
//--------------------------------------------------------------
Scene* Scene::execute()
{
    using namespace GameLib;

    // 初期化処理
    init();

    // ゲームループ
    while (GameLib::gameLoop(false))    // falseをtrueにするとタイトルバーにフレームレート表示
    {

        // 入力処理
        input::update();

        // 更新処理
        update();

        // 描画処理
        draw();

        // デバッグ文字列の描画
        //debug::display(1, 1, 1, 1, 1);
        //debug::setString("GP5_01");

        // 画面フリップ
        GameLib::present(1, 0);

        // 終了チェック
        if (nextScene_) break;
    }

    // 終了処理
    deinit();

    return nextScene_;	// 次のシーンを返す
}

//******************************************************************************
//
//      SceneManagerクラス
//
//******************************************************************************

//--------------------------------------------------------------
//  実行
//--------------------------------------------------------------
void SceneManager::execute(Scene* scene)
{
    using namespace GameLib;

    bool isFullScreen = false;	// フルスクリーンにするならtrueに変える
                                //（Releaseモードのみ）

    // ゲームライブラリの初期化処理
    GameLib::init(L"ゲームプログラミングV", 1280, 720, isFullScreen);

#ifndef _DEBUG
    ShowCursor(!isFullScreen);	// フルスクリーン時はカーソルを消す
#endif

    // テクスチャの読み込み
    texture::load(loadTexture);

    //ビューの設定
    view::init();

    // メインループ
    while (scene)
    {
        scene = scene->execute();
    }

    texture::releaseAll();

    // ゲームライブラリの終了処理
    GameLib::uninit();
}

//******************************************************************************
