//******************************************************************************
//
//
//      タイトル
//
//
//******************************************************************************

//------< インクルード >----------------------------------------------------------
#include "title.h"
#include "game.h"
#include "liquidfun/Pyramid.h"

//------< using >---------------------------------------------------------------
using namespace GameLib;

//------< 変数 >----------------------------------------------------------------
Title Title::instance_;

//--------------------------------------------------------------
//  初期設定
//--------------------------------------------------------------
void Title::init()
{
    Scene::init();
    fadeOut_ = 0.0f;
}

//--------------------------------------------------------------
//  更新処理
//--------------------------------------------------------------
void Title::update()
{
    using namespace input;

    switch (state_)
    {
    case 0:
        //////// 初期設定 ////////

        timer_ = 0;                                  // タイマーを初期化
        GameLib::setBlendMode(Blender::BS_ALPHA);   // 通常のアルファ処理

        //menu_ = new Menu;

        state_++;                                    // 初期化処理の終了

        /*fallthrough*/                             // 意図的にbreak;を記述していない

    case 1:
        //////// 通常時の処理 ////////
        if (TRG(0) & PAD_START)
        {
            state_++;
            break;
        }

        // メニューの更新
        //if (menu_) menu_->update();

        break;

    case 2:
        //////// フェードアウト ////////
        fadeOut_ += 0.0167f;
        if (fadeOut_ >= 1.0f)
        {
            //Game::instance()->setFunc(menu_->func());
            changeScene(Game::instance());
            break;
        }
        break;
    }

    timer_++;
}

//--------------------------------------------------------------
//  描画処理
//--------------------------------------------------------------
void Title::draw()
{
    // 画面クリア
    GameLib::clear(VECTOR4(0.012f, 0.537f, 1, 1));

    // タイトル表示
    font::textOut(4, "ECC COMP", { 60, 100 }, { 4, 4 }, { 1, 0.8f, 0.4f, 1 });
    font::textOut(4, "Game Programming V", { 50, 260 }, { 2, 2 }, { 0.5f, 1, 0.7f, 1 });

    // "Push Start Button" 点滅
    if (timer_ / 40 % 2)
    {
        font::textOut(4, "Push Start Button", { 160, 600 }, { 1.5, 1.5 }, { 1, 0.3f, 0, 1 });
    }

    // メニューの描画
    //if (menu_) menu_->draw();

    // フェードアウト
    if (fadeOut_ > 0.0f)
    {
        primitive::rect({ 0,0 }, { window::getWidth(), window::getHeight() },
            { 0,0 }, 0, { 0,0,0,fadeOut_ });
    }
}

//--------------------------------------------------------------
//  終了処理
//--------------------------------------------------------------
void Title::deinit()
{
    //safe_delete(menu_);
}

//******************************************************************************
